of+1806/tutorials/cavity_heatedWalls_Newtonian/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    movingLid
    {
        type            fixedValue;
    	value           uniform (1 0 0);
    }
    
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    westWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    eastWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    frontAndBack
    {
        type            empty;
    }
          
}

// ************************************************************************* //
